XIVN1987/MCUCode/board_CH32V/CH32V407/src/CSL/Startup/system_ch32v4x7.c
/********************************** (C) COPYRIGHT *******************************
* File Name          : system_ch32v4x7.c
* Author             : WCH
* Version            : V1.0.0
* Date               : 2025/12/01
* Description        : CH32V4x7 Device Peripheral Access Layer System Source File.
*                      For HSE = 25Mhz
*********************************************************************************
* Copyright (c) 2021 Nanjing Qinheng Microelectronics Co., Ltd.
* Attention: This software (modified or not) and binary are used for 
* microcontroller manufactured by Nanjing Qinheng Microelectronics.
*******************************************************************************/
#include "ch32v4x7.h" 

/* 
* Uncomment the line corresponding to the desired System clock (SYSCLK) frequency (after 
* reset the HSI is used as SYSCLK source).
* If none of the define below is enabled, the HSI is used as System clock source. 
*/
// #define SYSCLK_HCLK_HSE    HSE_VALUE
// #define SYSCLK_120MHz_HCLK_60MHz_HSE   120000000
// #define SYSCLK_240MHz_HCLK_120MHz_HSE  240000000  
// #define SYSCLK_350MHz_HCLK_175MHz_HSE  350000000 
#define SYSCLK_400MHz_HCLK_200MHz_HSE  400000000 
// #define SYSCLK_HCLK_HSI    HSI_VALUE
// #define SYSCLK_120MHz_HCLK_60MHz_HSI   120000000
// #define SYSCLK_240MHz_HCLK_120MHz_HSI  240000000 
// #define SYSCLK_350MHz_HCLK_175MHz_HSI  350000000
// #define SYSCLK_400MHz_HCLK_200MHz_HSI  400000000  

/*Only suitable for commercial applications, with a temperature not exceeding 70 °C and good heat dissipation*/
/* 
// #define SYSCLK_480MHz_HCLK_240MHz_HSE    480000000
// #define SYSCLK_480MHz_HCLK_240MHz_HSI    480000000 
*/

/* Clock Definitions */
uint32_t HCLKClock;
#ifdef SYSCLK_HCLK_HSE
uint32_t SystemClock         = SYSCLK_HCLK_HSE;                      /* System Clock Frequency */
uint32_t SystemCoreClock     = SYSCLK_HCLK_HSE;        
#elif defined SYSCLK_120MHz_HCLK_60MHz_HSE
uint32_t SystemClock         = SYSCLK_120MHz_HCLK_60MHz_HSE;         /* System Clock Frequency */
uint32_t SystemCoreClock     = SYSCLK_120MHz_HCLK_60MHz_HSE >> 1;
#elif defined SYSCLK_240MHz_HCLK_120MHz_HSE
uint32_t SystemClock         = SYSCLK_240MHz_HCLK_120MHz_HSE;        /* System Clock Frequency */
uint32_t SystemCoreClock     = SYSCLK_240MHz_HCLK_120MHz_HSE >> 1;
#elif defined SYSCLK_350MHz_HCLK_175MHz_HSE
uint32_t SystemClock         = SYSCLK_350MHz_HCLK_175MHz_HSE;        /* System Clock Frequency */
uint32_t SystemCoreClock     = SYSCLK_350MHz_HCLK_175MHz_HSE >> 1;
#elif defined SYSCLK_400MHz_HCLK_200MHz_HSE
uint32_t SystemClock         = SYSCLK_400MHz_HCLK_200MHz_HSE;        /* System Clock Frequency */
uint32_t SystemCoreClock     = SYSCLK_400MHz_HCLK_200MHz_HSE >> 1;
#elif defined SYSCLK_480MHz_HCLK_240MHz_HSE
uint32_t SystemClock         = SYSCLK_480MHz_HCLK_240MHz_HSE;        /* System Clock Frequency */
uint32_t SystemCoreClock     = SYSCLK_480MHz_HCLK_240MHz_HSE >> 1;
#elif defined SYSCLK_120MHz_HCLK_60MHz_HSI
uint32_t SystemClock         = SYSCLK_120MHz_HCLK_60MHz_HSI;         /* System Clock Frequency  */
uint32_t SystemCoreClock     = SYSCLK_120MHz_HCLK_60MHz_HSI >> 1;
#elif defined SYSCLK_240MHz_HCLK_120MHz_HSI
uint32_t SystemClock         = SYSCLK_240MHz_HCLK_120MHz_HSI;        /* System Clock Frequency */
uint32_t SystemCoreClock     = SYSCLK_240MHz_HCLK_120MHz_HSI >> 1;
#elif defined SYSCLK_350MHz_HCLK_175MHz_HSI
uint32_t SystemClock         = SYSCLK_350MHz_HCLK_175MHz_HSI;        /* System Clock Frequency */
uint32_t SystemCoreClock     = SYSCLK_350MHz_HCLK_175MHz_HSI >> 1;
#elif defined SYSCLK_400MHz_HCLK_200MHz_HSI
uint32_t SystemClock         = SYSCLK_400MHz_HCLK_200MHz_HSI;        /* System Clock Frequency  */
uint32_t SystemCoreClock     = SYSCLK_400MHz_HCLK_200MHz_HSI >> 1;
#elif defined SYSCLK_480MHz_HCLK_240MHz_HSI
uint32_t SystemClock         = SYSCLK_480MHz_HCLK_240MHz_HSI;        /* System Clock Frequency  */
uint32_t SystemCoreClock     = SYSCLK_480MHz_HCLK_240MHz_HSI >> 1;
#else
uint32_t SystemClock         = HSI_VALUE;                            /* System Clock Frequency  */
uint32_t SystemCoreClock     = HSI_VALUE;   

#endif

static __I uint8_t HBPrescTable[16] = {0, 0, 0, 0, 0, 0, 0, 0, 1, 2, 3, 4, 6, 7, 8, 9};
static __I uint8_t PLLMULTB[32] = {8,9,10,11,12,25,13,27,14,29,15,31,16,33,17,35,18,37,19,39,20,21,22,24,26,28,30,32,34,36,38,40};

/* system_private_function_proto_types */
static void SetSysClock(void);

#ifdef SYSCLK_HCLK_HSE
static void SetSYSCLK_HCLK_HSE( void );
#elif defined SYSCLK_120MHz_HCLK_60MHz_HSE
static void SetSYSCLK_120MHz_HCLK_60MHz_HSE( void );
#elif defined SYSCLK_240MHz_HCLK_120MHz_HSE
static void SetSYSCLK_240MHz_HCLK_120MHz_HSE( void );
#elif defined SYSCLK_350MHz_HCLK_175MHz_HSE
static void SetSYSCLK_350MHz_HCLK_175MHz_HSE( void );
#elif defined SYSCLK_400MHz_HCLK_200MHz_HSE
static void SetSYSCLK_400MHz_HCLK_200MHz_HSE( void );
#elif defined SYSCLK_480MHz_HCLK_240MHz_HSE
static void SetSYSCLK_480MHz_HCLK_240MHz_HSE( void );
#elif defined SYSCLK_120MHz_HCLK_60MHz_HSI
static void SetSYSCLK_120MHz_HCLK_60MHz_HSI( void );
#elif defined SYSCLK_240MHz_HCLK_120MHz_HSI
static void SetSYSCLK_240MHz_HCLK_120MHz_HSI( void );
#elif defined SYSCLK_350MHz_HCLK_175MHz_HSI
static void SetSYSCLK_350MHz_HCLK_175MHz_HSI( void );
#elif defined SYSCLK_400MHz_HCLK_200MHz_HSI
static void SetSYSCLK_400MHz_HCLK_200MHz_HSI( void );
#elif defined SYSCLK_480MHz_HCLK_240MHz_HSI
static void SetSYSCLK_480MHz_HCLK_240MHz_HSI( void );
#else
static void SetSYSCLK_HCLK_HSI( void );
#endif

/*********************************************************************
 * @fn      SystemInit
 *
 * @brief   Setup the microcontroller system Initialize the Embedded Flash Interface,
 *        the PLL and update the SystemClock variable.
 *
 * @return  none
 */
void SystemInit (void)
{
  RCC->CTLR |= (uint32_t)0x00000001;
  RCC->CFGR0 &= (uint32_t)0x80FF0000;
  while ((RCC->CFGR0 & (uint32_t)RCC_SWS) != (uint32_t)0x00)
  {
  }

  RCC->CTLR &= (uint32_t)0xFEA6FFFF;
  RCC->CTLR &= (uint32_t)0xFFFBFFFF;

