XIVN1987/MCUCode/board_CH32V/CH32V407/src/CSL/Startup/system_ch32v4x7.c
  RCC->CFGR0 &= (uint32_t)0xFFC0FFFF;
  RCC->CFGR2 &= (uint32_t)0xFFFFEFFF;
  RCC->CFGR2 &= (uint32_t)0x03F11800;

  RCC->CFGR0 |= (uint32_t)(0x20000000);
  RCC->CFGR3 = 0x00000000;
  RCC->INTR = 0x008F0000;   

  SetSysClock();
}

/*********************************************************************
 * @fn      SystemCoreClockUpdate
 *
 * @brief   Update SystemCoreClock variable according to Clock Register Values.
 *
 * @return  none
 */
void SystemCoreClockUpdate (void)
{
  uint32_t tmp = 0, tmp1 = 0, tmp2 = 0, pllmull = 0, pllsource = 0, presc = 0;
  uint8_t Plldiv2 = 0;

  tmp = RCC->CFGR0 & RCC_SWS;
  tmp1 = RCC->CFGR2 & RCC_SYSPLLSRC;

  switch (tmp)
  {
    case 0x00:
      SystemClock = HSI_VALUE;
      break;
    case 0x04:  
      SystemClock = HSE_VALUE;
      break;
    case 0x08: 
      pllsource = RCC->CFGR0 & RCC_PLLSRC; 
      presc = ((RCC->CFGR2 & RCC_SYSPLLDIV)>>8) + 1;
      tmp2 = (RCC->CFGR0 & RCC_PLLMULL)>>17;
      pllmull = PLLMULTB[tmp2];
      if((tmp2 > 4) && (tmp2 < 20) && ((tmp2 % 2) != 0))
      {
        Plldiv2 = 1;
      }

      switch (tmp1) 
      {
        case RCC_SYSPLLSRC_USBHSPLL:
          SystemClock = 480000000;
        break;

        case RCC_SYSPLLSRC_ETHPLL:
          SystemClock = 500000000;
        break;

        case RCC_SYSPLLSRC_USBHSPLL_MUL2_DIV3:
          SystemClock = 320000000;
        break;

        case RCC_SYSPLLSRC_ETHPLL_MUL2_DIV3:
          SystemClock = 333000000;
        break;

        case RCC_SYSPLLSRC_PLL:

          if(pllsource == 0x00) //HSI
          {
            SystemClock = HSI_VALUE*pllmull;
          }
          else 
          {
            SystemClock = HSE_VALUE*pllmull;
          }
          SystemClock /= (1 + Plldiv2);
        break;

        default:
        break;
      }
      SystemClock /= presc;
      break;

      default:
      SystemClock = HSI_VALUE;
      break;
  }
    tmp = HBPrescTable[((RCC->CFGR0 & RCC_HPRE) >> 4)];
    SystemCoreClock = SystemClock >> tmp; 
    HCLKClock =  SystemCoreClock;
}

/*********************************************************************
 * @fn      SetSysClock
 *
 * @brief   Configures the System clock frequency, HCLK, PCLK2 and PCLK1 prescalers.
 *
 * @return  none
 */
static void SetSysClock(void)
{
    GPIO_IPD_Unused();
#ifdef SYSCLK_HCLK_HSE
    SetSYSCLK_HCLK_HSE();
#elif defined SYSCLK_120MHz_HCLK_60MHz_HSE
    SetSYSCLK_120MHz_HCLK_60MHz_HSE();
#elif defined SYSCLK_240MHz_HCLK_120MHz_HSE
    SetSYSCLK_240MHz_HCLK_120MHz_HSE();
#elif defined SYSCLK_350MHz_HCLK_175MHz_HSE
    SetSYSCLK_350MHz_HCLK_175MHz_HSE();
#elif defined SYSCLK_400MHz_HCLK_200MHz_HSE
    SetSYSCLK_400MHz_HCLK_200MHz_HSE();    
#elif defined SYSCLK_480MHz_HCLK_240MHz_HSE
    SetSYSCLK_480MHz_HCLK_240MHz_HSE();    
#elif defined SYSCLK_120MHz_HCLK_60MHz_HSI
    SetSYSCLK_120MHz_HCLK_60MHz_HSI();
#elif defined SYSCLK_240MHz_HCLK_120MHz_HSI
    SetSYSCLK_240MHz_HCLK_120MHz_HSI();
#elif defined SYSCLK_350MHz_HCLK_175MHz_HSI
    SetSYSCLK_350MHz_HCLK_175MHz_HSI();
#elif defined SYSCLK_400MHz_HCLK_200MHz_HSI
    SetSYSCLK_400MHz_HCLK_200MHz_HSI();  
#elif defined SYSCLK_480MHz_HCLK_240MHz_HSI
    SetSYSCLK_480MHz_HCLK_240MHz_HSI();  
#else 
    SetSYSCLK_HCLK_HSI();
#endif
 
/* 
  * If none of the define above is enabled, the HSI is used as System clock
  * source (default after reset) 
  */
}


#ifdef SYSCLK_HCLK_HSE

/*********************************************************************
 * @fn      SetSYSCLK_HCLK_HSE
 *
 * @brief   Sets HSE as System clock source and configure HCLK, PCLK2 and PCLK1 prescalers.
 *
 * @return  none
 */
static void SetSYSCLK_HCLK_HSE(void)
{
  __IO uint32_t StartUpCounter = 0, HSEStatus = 0, FLASH_Temp = 0;
   
  RCC->CTLR |= ((uint32_t)RCC_HSEON);
 
  /* Wait till HSE is ready and if Time out is reached exit */
  do
  {
    HSEStatus = RCC->CTLR & RCC_HSERDY;
    StartUpCounter++;  
  } while((HSEStatus == 0) && (StartUpCounter != HSE_STARTUP_TIMEOUT));

  if ((RCC->CTLR & RCC_HSERDY) != RESET)
  {
    HSEStatus = (uint32_t)0x01;
  }
  else
  {
    HSEStatus = (uint32_t)0x00;
  }  

  if (HSEStatus == (uint32_t)0x01)
  {
    /* HCLK = SYSCLK */
    RCC->CFGR0 |= (uint32_t)RCC_HPRE_DIV1;      
    /* PCLK2 = HCLK */
    RCC->CFGR0 |= (uint32_t)RCC_PPRE2_DIV1;
    /* PCLK1 = HCLK */
    RCC->CFGR0 |= (uint32_t)RCC_PPRE1_DIV1;
    
    /* Select FLASH clock frequency*/
    FLASH->KEYR = ((uint32_t)0x45670123);
    FLASH->KEYR = ((uint32_t)0xCDEF89AB);
    FLASH->MODEKEYR = ((uint32_t)0x45670123);
    FLASH->MODEKEYR = ((uint32_t)0xCDEF89AB);

    FLASH_Temp = FLASH->CTLR ;
    FLASH_Temp &= ~((uint32_t)FLASH_CTLR_SCKMOD);
    FLASH_Temp |= FLASH_CTLR_SCKMOD_Div1;
    FLASH->CTLR = FLASH_Temp;
    FLASH->CTLR |= ((uint32_t)0x00008080);

    /* Select HSE as system clock source */
    RCC->CFGR0 |= (uint32_t)RCC_SW_HSE;    

    /* Wait till HSE is used as system clock source */
    while ((RCC->CFGR0 & (uint32_t)RCC_SWS) != (uint32_t)0x04)
    {
    }
  }
  else
  { 
      /* 
       * If HSE fails to start-up, the application will have wrong clock
       * configuration. User can add here some code to deal with this error 
       */
  }  
}

#elif defined SYSCLK_120MHz_HCLK_60MHz_HSE

/*********************************************************************
 * @fn      SetSYSCLK_120MHz_HCLK_60MHz_HSE
 *
 * @brief   Sets System clock frequency to 120MHz and configure HCLK, PCLK2 and PCLK1 prescalers.
 *
 * @return  none
 */
static void SetSYSCLK_120MHz_HCLK_60MHz_HSE(void)
{
    __IO uint32_t StartUpCounter = 0, HSEStatus = 0 , FLASH_Temp = 0;

    RCC->CTLR |= ((uint32_t)RCC_HSEON);

    /* Wait till HSE is ready and if Time out is reached exit */
    do
    {
      HSEStatus = RCC->CTLR & RCC_HSERDY;
      StartUpCounter++;
    } while((HSEStatus == 0) && (StartUpCounter != HSE_STARTUP_TIMEOUT));

