XIVN1987/MCUCode/board_CH32V/CH32V407/src/CSL/Startup/system_ch32v4x7.c
      /* Select FLASH clock frequency*/
      FLASH->KEYR = ((uint32_t)0x45670123);
      FLASH->KEYR = ((uint32_t)0xCDEF89AB);
      FLASH->MODEKEYR = ((uint32_t)0x45670123);
      FLASH->MODEKEYR = ((uint32_t)0xCDEF89AB);

      FLASH_Temp = FLASH->CTLR ;
      FLASH_Temp &= ~((uint32_t)FLASH_CTLR_SCKMOD);
      FLASH_Temp |= FLASH_CTLR_SCKMOD_Div2;
      FLASH->CTLR = FLASH_Temp;
      FLASH->CTLR |= ((uint32_t)0x00008080);

      /* Select PLL as system clock source */
      RCC->CFGR2 |= (uint32_t)RCC_SYSPLL_GATE;
      RCC->CFGR0 |= (uint32_t)RCC_SW_PLL;
      /* Wait till PLL is used as system clock source */
      while ((RCC->CFGR0 & (uint32_t)RCC_SWS) != (uint32_t)0x08)
      {
      }
    }
    else
    {
      /*
       * If HSE fails to start-up, the application will have wrong clock
       * configuration. User can add here some code to deal with this error
       */
    }
}

#elif defined SYSCLK_400MHz_HCLK_200MHz_HSE

/*********************************************************************
 * @fn      SetSYSCLK_400MHz_HCLK_200MHz_HSE
 *
 * @brief   Sets System clock frequency to 400MHz and configure HCLK, PCLK2 and PCLK1 prescalers.
 *
 * @return  none
 */
static void SetSYSCLK_400MHz_HCLK_200MHz_HSE(void)
{
    __IO uint32_t StartUpCounter = 0, HSEStatus = 0 , FLASH_Temp = 0;

    RCC->CTLR |= ((uint32_t)RCC_HSEON);

    /* Wait till HSE is ready and if Time out is reached exit */
    do
    {
      HSEStatus = RCC->CTLR & RCC_HSERDY;
      StartUpCounter++;
    } while((HSEStatus == 0) && (StartUpCounter != HSE_STARTUP_TIMEOUT));

    if ((RCC->CTLR & RCC_HSERDY) != RESET)
    {
      HSEStatus = (uint32_t)0x01;
    }
    else
    {
      HSEStatus = (uint32_t)0x00;
    }

    if (HSEStatus == (uint32_t)0x01)
    {
      /* HCLK = SYSCLK /2 */
      RCC->CFGR0 |= (uint32_t)RCC_HPRE_DIV2;
      /* PCLK2 = HCLK */
      RCC->CFGR0 |= (uint32_t)RCC_PPRE2_DIV1;
      /* PCLK1 = HCLK */
      RCC->CFGR0 |= (uint32_t)RCC_PPRE1_DIV1;

      /* PLL configuration: HCLK = (HSE * 16) / 2 = 200 MHz */
      RCC->CFGR0 |= (uint32_t)(RCC_PLLSRC_HSE | RCC_PLLMULL16);

      /* Enable PLL */
      RCC->CTLR |= RCC_PLLON;
      /* Wait till PLL is ready */
      while((RCC->CTLR & RCC_PLLRDY) == 0)
      {
      }

      RCC->CFGR2 |= (uint32_t)(RCC_SYSPLLSRC_PLL | RCC_SYSPLLDIV1);
      /* Wait till PLL clock is used as SYSPLLSRC clock source */
      while ((RCC->CFGR2 & (uint32_t)RCC_SYSPLLSRC) != (uint32_t)RCC_SYSPLLSRC_PLL)
      {
      }     

      /* Select FLASH clock frequency*/
      FLASH->KEYR = ((uint32_t)0x45670123);
      FLASH->KEYR = ((uint32_t)0xCDEF89AB);
      FLASH->MODEKEYR = ((uint32_t)0x45670123);
      FLASH->MODEKEYR = ((uint32_t)0xCDEF89AB);

      FLASH_Temp = FLASH->CTLR ;
      FLASH_Temp &= ~((uint32_t)FLASH_CTLR_SCKMOD);
      FLASH_Temp |= FLASH_CTLR_SCKMOD_Div2;
      FLASH->CTLR = FLASH_Temp;
      FLASH->CTLR |= ((uint32_t)0x00008080);

      /* Select PLL as system clock source */
      RCC->CFGR2 |= (uint32_t)RCC_SYSPLL_GATE;
      RCC->CFGR0 |= (uint32_t)RCC_SW_PLL;
      /* Wait till PLL is used as system clock source */
      while ((RCC->CFGR0 & (uint32_t)RCC_SWS) != (uint32_t)0x08)
      {
      }
    }
    else
    {
      /*
       * If HSE fails to start-up, the application will have wrong clock
       * configuration. User can add here some code to deal with this error
       */
    }
}

#elif defined SYSCLK_480MHz_HCLK_240MHz_HSE

/*********************************************************************
 * @fn      SetSYSCLK_480MHz_HCLK_240MHz_HSE
 *
 * @brief   Sets System clock frequency to 480MHz and configure HCLK, PCLK2 and PCLK1 prescalers.
 *
 * @return  none
 */
static void SetSYSCLK_480MHz_HCLK_240MHz_HSE(void)
{
    __IO uint32_t StartUpCounter = 0, HSEStatus = 0 , FLASH_Temp = 0, tmpreg = 0;

    /* Set VDDK to 1.23V */
    RCC->PB1PCENR |= RCC_PB1Periph_PWR;
    tmpreg = PWR->CTLR; 
    tmpreg &= ~PWR_CTLR_LDOVDDK;
    tmpreg |= PWR_VDDK_Level4;
    PWR->CTLR = tmpreg;

    RCC->CTLR |= ((uint32_t)RCC_HSEON);

    /* Wait till HSE is ready and if Time out is reached exit */
    do
    {
      HSEStatus = RCC->CTLR & RCC_HSERDY;
      StartUpCounter++;
    } while((HSEStatus == 0) && (StartUpCounter != HSE_STARTUP_TIMEOUT));

    if ((RCC->CTLR & RCC_HSERDY) != RESET)
    {
      HSEStatus = (uint32_t)0x01;
    }
    else
    {
      HSEStatus = (uint32_t)0x00;
    }

    if (HSEStatus == (uint32_t)0x01)
    {
      /* HCLK = SYSCLK / 2 */
      RCC->CFGR0 |= (uint32_t)RCC_HPRE_DIV2;
      /* PCLK2 = HCLK */
      RCC->CFGR0 |= (uint32_t)RCC_PPRE2_DIV1;
      /* PCLK1 = HCLK */
      RCC->CFGR0 |= (uint32_t)RCC_PPRE1_DIV1;

      /* PLL configuration: HCLK = (USBHSPLL(480M) / 1) / 2 = 120 MHz */
      RCC->CFGR2 |= (uint32_t)(RCC_USBHSPLLSRC_HSE | RCC_USBHSPLLCLK_25M);
      /* Enable USBHSPLL */
      RCC->CTLR |= RCC_USBHSPLLON;
      /* Wait till PLL is ready */
      while((RCC->CTLR & RCC_USBHSPLLRDY) == 0)
      {
      }

      RCC->CFGR2 |= (uint32_t)(RCC_SYSPLLSRC_USBHSPLL | RCC_SYSPLLDIV1);
      /* Wait till USBHSPLL clock is used as SYSPLLSRC clock source */
      while ((RCC->CFGR2 & (uint32_t)RCC_SYSPLLSRC) != (uint32_t)RCC_SYSPLLSRC_USBHSPLL)
      {
      }     

      /* Select FLASH clock frequency*/
      FLASH->KEYR = ((uint32_t)0x45670123);
      FLASH->KEYR = ((uint32_t)0xCDEF89AB);
      FLASH->MODEKEYR = ((uint32_t)0x45670123);
      FLASH->MODEKEYR = ((uint32_t)0xCDEF89AB);

      FLASH_Temp = FLASH->CTLR ;
      FLASH_Temp &= ~((uint32_t)FLASH_CTLR_SCKMOD);
      FLASH_Temp |= FLASH_CTLR_SCKMOD_Div4;
      FLASH->CTLR = FLASH_Temp;
      FLASH->CTLR |= ((uint32_t)0x00008080);

      /* Select PLL as system clock source */
      RCC->CFGR2 |= (uint32_t)RCC_SYSPLL_GATE;
      RCC->CFGR0 |= (uint32_t)RCC_SW_PLL;
      /* Wait till PLL is used as system clock source */
      while ((RCC->CFGR0 & (uint32_t)RCC_SWS) != (uint32_t)0x08)
      {
      }
    }
    else
    {
      /*
       * If HSE fails to start-up, the application will have wrong clock
       * configuration. User can add here some code to deal with this error
       */
    }
}

