XIVN1987/MCUCode/board_CH32V/CH32V407/src/CSL/Startup/system_ch32v4x7.c
#elif defined SYSCLK_120MHz_HCLK_60MHz_HSI

/*********************************************************************
 * @fn      SetSYSCLK_120MHz_HCLK_60MHz_HSI
 *
 * @brief   Sets System clock frequency to 120MHz and configure HCLK, PCLK2 and PCLK1 prescalers.
 *
 * @return  none
 */
static void SetSYSCLK_120MHz_HCLK_60MHz_HSI(void)
{
    __IO uint32_t FLASH_Temp = 0;

    /* HCLK = SYSCLK / 2 */
    RCC->CFGR0 |= (uint32_t)RCC_HPRE_DIV2;
    /* PCLK2 = HCLK */
    RCC->CFGR0 |= (uint32_t)RCC_PPRE2_DIV1;
    /* PCLK1 = HCLK */
    RCC->CFGR0 |= (uint32_t)RCC_PPRE1_DIV1;

    /* PLL configuration: HCLK = (HSI * 12 / 2) / 2 = 60 MHz */
    RCC->CFGR0 |= (uint32_t)(RCC_PLLSRC_HSI | RCC_PLLMULL12);

    /* Enable PLL */
    RCC->CTLR |= RCC_PLLON;
    /* Wait till PLL is ready */
    while((RCC->CTLR & RCC_PLLRDY) == 0)
    {
    }

    RCC->CFGR2 |= (uint32_t)(RCC_SYSPLLSRC_PLL | RCC_SYSPLLDIV2);
    /* Wait till PLL clock is used as SYSPLLSRC clock source */
    while ((RCC->CFGR2 & (uint32_t)RCC_SYSPLLSRC) != (uint32_t)RCC_SYSPLLSRC_PLL)
    {
    }     

    /* Select FLASH clock frequency*/
    FLASH->KEYR = ((uint32_t)0x45670123);
    FLASH->KEYR = ((uint32_t)0xCDEF89AB);
    FLASH->MODEKEYR = ((uint32_t)0x45670123);
    FLASH->MODEKEYR = ((uint32_t)0xCDEF89AB);

    FLASH_Temp = FLASH->CTLR ;
    FLASH_Temp &= ~((uint32_t)FLASH_CTLR_SCKMOD);
    FLASH_Temp |= FLASH_CTLR_SCKMOD_Div1;
    FLASH->CTLR = FLASH_Temp;
    FLASH->CTLR |= ((uint32_t)0x00008080);

    /* Select PLL as system clock source */
    RCC->CFGR2 |= (uint32_t)RCC_SYSPLL_GATE;
    RCC->CFGR0 &= (uint32_t)((uint32_t)~(RCC_SW));
    RCC->CFGR0 |= (uint32_t)RCC_SW_PLL;
    /* Wait till PLL is used as system clock source */
    while ((RCC->CFGR0 & (uint32_t)RCC_SWS) != (uint32_t)0x08)
    {
    }
}

#elif defined SYSCLK_240MHz_HCLK_120MHz_HSI

/*********************************************************************
 * @fn      SetSYSCLK_240MHz_HCLK_120MHz_HSI
 *
 * @brief   Sets System clock frequency to 240MHz and configure HCLK, PCLK2 and PCLK1 prescalers.
 *
 * @return  none
 */
static void SetSYSCLK_240MHz_HCLK_120MHz_HSI(void)
{
    __IO uint32_t FLASH_Temp = 0;

    /* HCLK = SYSCLK / 2 */
    RCC->CFGR0 |= (uint32_t)RCC_HPRE_DIV2;
    /* PCLK2 = HCLK */
    RCC->CFGR0 |= (uint32_t)RCC_PPRE2_DIV1;
    /* PCLK1 = HCLK */
    RCC->CFGR0 |= (uint32_t)RCC_PPRE1_DIV1;

    /* PLL configuration: HCLK = HSI * 12 / 1 / 2 = 120 MHz */
    RCC->CFGR0 |= (uint32_t)(RCC_PLLSRC_HSI | RCC_PLLMULL12);
    
    /* Enable PLL */
    RCC->CTLR |= RCC_PLLON;
    /* Wait till PLL is ready */
    while((RCC->CTLR & RCC_PLLRDY) == 0)
    {
    }

    RCC->CFGR2 |= (uint32_t)(RCC_SYSPLLSRC_PLL | RCC_SYSPLLDIV1);
    /* Wait till PLL clock is used as SYSPLLSRC clock source */
    while ((RCC->CFGR2 & (uint32_t)RCC_SYSPLLSRC) != (uint32_t)RCC_SYSPLLSRC_PLL)
    {
    }     

    /* Select FLASH clock frequency*/
    FLASH->KEYR = ((uint32_t)0x45670123);
    FLASH->KEYR = ((uint32_t)0xCDEF89AB);
    FLASH->MODEKEYR = ((uint32_t)0x45670123);
    FLASH->MODEKEYR = ((uint32_t)0xCDEF89AB);

    FLASH_Temp = FLASH->CTLR ;
    FLASH_Temp &= ~((uint32_t)FLASH_CTLR_SCKMOD);
    FLASH_Temp |= FLASH_CTLR_SCKMOD_Div2;
    FLASH->CTLR = FLASH_Temp;
    FLASH->CTLR |= ((uint32_t)0x00008080);

    /* Select PLL as system clock source */
    RCC->CFGR2 |= (uint32_t)RCC_SYSPLL_GATE;
    RCC->CFGR0 &= (uint32_t)((uint32_t)~(RCC_SW));
    RCC->CFGR0 |= (uint32_t)RCC_SW_PLL;
    /* Wait till PLL is used as system clock source */
    while ((RCC->CFGR0 & (uint32_t)RCC_SWS) != (uint32_t)0x08)
    {
    }
}

#elif defined SYSCLK_350MHz_HCLK_175MHz_HSI

/*********************************************************************
 * @fn      SetSYSCLK_350MHz_HCLK_175MHz_HSI
 *
 * @brief   Sets System clock frequency to 350MHz and configure HCLK, PCLK2 and PCLK1 prescalers.
 *
 * @return  none
 */
static void SetSYSCLK_350MHz_HCLK_175MHz_HSI(void)
{
    __IO uint32_t FLASH_Temp = 0;

    /* HCLK = SYSCLK / 2 */
    RCC->CFGR0 |= (uint32_t)RCC_HPRE_DIV2;
    /* PCLK2 = HCLK */
    RCC->CFGR0 |= (uint32_t)RCC_PPRE2_DIV1;
    /* PCLK1 = HCLK */
    RCC->CFGR0 |= (uint32_t)RCC_PPRE1_DIV1;

    /* PLL configuration: HCLK = HSI * 17.5 / 1 / 2 = 175 MHz */
    RCC->CFGR0 |= (uint32_t)(RCC_PLLSRC_HSI | RCC_PLLMULL17_5);
    
    /* Enable PLL */
    RCC->CTLR |= RCC_PLLON;
    /* Wait till PLL is ready */
    while((RCC->CTLR & RCC_PLLRDY) == 0)
    {
    }

    RCC->CFGR2 |= (uint32_t)(RCC_SYSPLLSRC_PLL | RCC_SYSPLLDIV1);
    /* Wait till PLL clock is used as SYSPLLSRC clock source */
    while ((RCC->CFGR2 & (uint32_t)RCC_SYSPLLSRC) != (uint32_t)RCC_SYSPLLSRC_PLL)
    {
    }     

    /* Select FLASH clock frequency*/
    FLASH->KEYR = ((uint32_t)0x45670123);
    FLASH->KEYR = ((uint32_t)0xCDEF89AB);
    FLASH->MODEKEYR = ((uint32_t)0x45670123);
    FLASH->MODEKEYR = ((uint32_t)0xCDEF89AB);

    FLASH_Temp = FLASH->CTLR ;
    FLASH_Temp &= ~((uint32_t)FLASH_CTLR_SCKMOD);
    FLASH_Temp |= FLASH_CTLR_SCKMOD_Div2;
    FLASH->CTLR = FLASH_Temp;
    FLASH->CTLR |= ((uint32_t)0x00008080);

    /* Select PLL as system clock source */
    RCC->CFGR2 |= (uint32_t)RCC_SYSPLL_GATE;
    RCC->CFGR0 &= (uint32_t)((uint32_t)~(RCC_SW));
    RCC->CFGR0 |= (uint32_t)RCC_SW_PLL;
    /* Wait till PLL is used as system clock source */
    while ((RCC->CFGR0 & (uint32_t)RCC_SWS) != (uint32_t)0x08)
    {
    }
}

#elif defined SYSCLK_400MHz_HCLK_200MHz_HSI

/*********************************************************************
 * @fn      SetSYSCLK_400MHz_HCLK_200MHz_HSI
 *
 * @brief   Sets System clock frequency to 400MHz and configure HCLK, PCLK2 and PCLK1 prescalers.
 *
 * @return  none
 */
static void SetSYSCLK_400MHz_HCLK_200MHz_HSI(void)
{
    __IO uint32_t FLASH_Temp = 0;

    /* HCLK = SYSCLK / 2 */
    RCC->CFGR0 |= (uint32_t)RCC_HPRE_DIV2;
    /* PCLK2 = HCLK */
    RCC->CFGR0 |= (uint32_t)RCC_PPRE2_DIV1;
    /* PCLK1 = HCLK */
    RCC->CFGR0 |= (uint32_t)RCC_PPRE1_DIV1;

