XIVN1987/MCUCode/board_CH32V/CH32V407/src/CSL/Startup/system_ch32v4x7.c
    /* PLL configuration: HCLK = HSI * 20 / 1 / 2 = 200 MHz */
    RCC->CFGR0 |= (uint32_t)(RCC_PLLSRC_HSI | RCC_PLLMULL20);
    
    /* Enable PLL */
    RCC->CTLR |= RCC_PLLON;
    /* Wait till PLL is ready */
    while((RCC->CTLR & RCC_PLLRDY) == 0)
    {
    }

    RCC->CFGR2 |= (uint32_t)(RCC_SYSPLLSRC_PLL | RCC_SYSPLLDIV1);
    /* Wait till PLL clock is used as SYSPLLSRC clock source */
    while ((RCC->CFGR2 & (uint32_t)RCC_SYSPLLSRC) != (uint32_t)RCC_SYSPLLSRC_PLL)
    {
    }     

    /* Select FLASH clock frequency*/
    FLASH->KEYR = ((uint32_t)0x45670123);
    FLASH->KEYR = ((uint32_t)0xCDEF89AB);
    FLASH->MODEKEYR = ((uint32_t)0x45670123);
    FLASH->MODEKEYR = ((uint32_t)0xCDEF89AB);

    FLASH_Temp = FLASH->CTLR ;
    FLASH_Temp &= ~((uint32_t)FLASH_CTLR_SCKMOD);
    FLASH_Temp |= FLASH_CTLR_SCKMOD_Div2;
    FLASH->CTLR = FLASH_Temp;
    FLASH->CTLR |= ((uint32_t)0x00008080);

    /* Select PLL as system clock source */
    RCC->CFGR2 |= (uint32_t)RCC_SYSPLL_GATE;
    RCC->CFGR0 &= (uint32_t)((uint32_t)~(RCC_SW));
    RCC->CFGR0 |= (uint32_t)RCC_SW_PLL;
    /* Wait till PLL is used as system clock source */
    while ((RCC->CFGR0 & (uint32_t)RCC_SWS) != (uint32_t)0x08)
    {
    }
}

#elif defined SYSCLK_480MHz_HCLK_240MHz_HSI

/*********************************************************************
 * @fn      SetSYSCLK_480MHz_HCLK_240MHz_HSI
 *
 * @brief   Sets System clock frequency to 480MHz and configure HCLK, PCLK2 and PCLK1 prescalers.
 *
 * @return  none
 */
static void SetSYSCLK_480MHz_HCLK_240MHz_HSI(void)
{
    __IO uint32_t FLASH_Temp = 0, tmpreg = 0;

    /* Set VDDK to 1.23V */
    RCC->PB1PCENR |= RCC_PB1Periph_PWR;
    tmpreg = PWR->CTLR; 
    tmpreg &= ~PWR_CTLR_LDOVDDK;
    tmpreg |= PWR_VDDK_Level4;
    PWR->CTLR = tmpreg;

    /* HCLK = SYSCLK / 2 */
    RCC->CFGR0 |= (uint32_t)RCC_HPRE_DIV2;
    /* PCLK2 = HCLK */
    RCC->CFGR0 |= (uint32_t)RCC_PPRE2_DIV1;
    /* PCLK1 = HCLK */
    RCC->CFGR0 |= (uint32_t)RCC_PPRE1_DIV1;

    /* PLL configuration: HCLK = HSI * 24 / 1 / 2 = 240 MHz */
    RCC->CFGR0 |= (uint32_t)(RCC_PLLSRC_HSI | RCC_PLLMULL24);
    
    /* Enable PLL */
    RCC->CTLR |= RCC_PLLON;
    /* Wait till PLL is ready */
    while((RCC->CTLR & RCC_PLLRDY) == 0)
    {
    }

    RCC->CFGR2 |= (uint32_t)(RCC_SYSPLLSRC_PLL | RCC_SYSPLLDIV1);
    /* Wait till PLL clock is used as SYSPLLSRC clock source */
    while ((RCC->CFGR2 & (uint32_t)RCC_SYSPLLSRC) != (uint32_t)RCC_SYSPLLSRC_PLL)
    {
    }     

    /* Select FLASH clock frequency*/
    FLASH->KEYR = ((uint32_t)0x45670123);
    FLASH->KEYR = ((uint32_t)0xCDEF89AB);
    FLASH->MODEKEYR = ((uint32_t)0x45670123);
    FLASH->MODEKEYR = ((uint32_t)0xCDEF89AB);

    FLASH_Temp = FLASH->CTLR ;
    FLASH_Temp &= ~((uint32_t)FLASH_CTLR_SCKMOD);
    FLASH_Temp |= FLASH_CTLR_SCKMOD_Div4;
    FLASH->CTLR = FLASH_Temp;
    FLASH->CTLR |= ((uint32_t)0x00008080);

    /* Select PLL as system clock source */
    RCC->CFGR2 |= (uint32_t)RCC_SYSPLL_GATE;
    RCC->CFGR0 &= (uint32_t)((uint32_t)~(RCC_SW));
    RCC->CFGR0 |= (uint32_t)RCC_SW_PLL;
    /* Wait till PLL is used as system clock source */
    while ((RCC->CFGR0 & (uint32_t)RCC_SWS) != (uint32_t)0x08)
    {
    }
}

#else 

/*********************************************************************
 * @fn      SetSYSCLK_HCLK_HSI
 *
 * @brief   Sets HSI as System clock source and configure HCLK, PCLK2 and PCLK1 prescalers.
 *
 * @return  none
 */
static void SetSYSCLK_HCLK_HSI(void)
{
    __IO uint32_t FLASH_Temp = 0;

    /* HCLK = SYSCLK */
    RCC->CFGR0 |= (uint32_t)RCC_HPRE_DIV1;
    /* PCLK2 = HCLK */
    RCC->CFGR0 |= (uint32_t)RCC_PPRE2_DIV1;
    /* PCLK1 = HCLK */
    RCC->CFGR0 |= (uint32_t)RCC_PPRE1_DIV1;

    /* Select FLASH clock frequency*/
    FLASH->KEYR = ((uint32_t)0x45670123);
    FLASH->KEYR = ((uint32_t)0xCDEF89AB);
    FLASH->MODEKEYR = ((uint32_t)0x45670123);
    FLASH->MODEKEYR = ((uint32_t)0xCDEF89AB);

    FLASH_Temp = FLASH->CTLR ;
    FLASH_Temp &= ~((uint32_t)FLASH_CTLR_SCKMOD);
    FLASH_Temp |= FLASH_CTLR_SCKMOD_Div1;
    FLASH->CTLR = FLASH_Temp;
    FLASH->CTLR |= ((uint32_t)0x00008080);

    /* Select HSI as system clock source */
    RCC->CFGR0 &= (uint32_t)((uint32_t)~(RCC_SW));
    RCC->CFGR0 |= (uint32_t)RCC_SW_HSI;
    /* Wait till HSI is used as system clock source */
    while ((RCC->CFGR0 & (uint32_t)RCC_SWS) != (uint32_t)0x00)
    {
    }
}

#endif
